In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
list=[4,8,15,16,23,42]
pd.Series(list)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
my_list=[23,54,3,56,2,78,23,7,2,87]
my_series=pd.Series(my_list)
my_series

0    23
1    54
2     3
3    56
4     2
5    78
6    23
7     7
8     2
9    87
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
data={"Name":["Alice","Bob","Claire"],
     "Age":[25,30,27],
     "Gender":["Female","Male","Female"]}
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame:- A DataFrame is a two dimesional data structure with rows and columns that holds multiple panda series  in tabular format.

Series:- A Series is a one dimesional data structure that stores a single column of data with an associated index.

In [14]:
Series_dataframe={"name":["akshay","surekha","payal","nitya"],
                  "age":[20,19,19,21],
                  "gender":["male","Female","Female","Female"]}

dataframe=pd.DataFrame(Series_dataframe)
print("Dataframe")
dataframe #example of dataframe

Dataframe

      name  age  gender
0   akshay   20    male
1  surekha   19  Female
2    payal   19  Female
3    nitya   21  Female

In [15]:
print("Series")
pd.Series(dataframe["age"])

Series

0    20
1    19
2    19
3    21
Name: age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head() and tail() are functions you can use to manipulare data in a pandas  Dataframe.

In [20]:
data1 = {
    'Name': ['John', 'Alice', 'Bob', 'Eve'],
    'Age': [28, 24, 22, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'San Francisco']
}
df=pd.DataFrame(data1)
df

    Name  Age           City
0   John   28       New York
1  Alice   24    Los Angeles
2    Bob   22        Chicago
3    Eve   30  San Francisco

In [21]:
df.head()

    Name  Age           City
0   John   28       New York
1  Alice   24    Los Angeles
2    Bob   22        Chicago
3    Eve   30  San Francisco

In [22]:
df.tail()

    Name  Age           City
0   John   28       New York
1  Alice   24    Los Angeles
2    Bob   22        Chicago
3    Eve   30  San Francisco

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame: A DataFrame is mutable, meaning you can modify its contents, add or remove rows and columns, and update values in the DataFrame after it has been created.

In [26]:
dict = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [28, 24, 22],
}
df1=pd.DataFrame(dict)
df1

    Name  Age
0   John   28
1  Alice   24
2    Bob   22

In [36]:
df1["cities"]=["mumbai","indore","pune"]
df1

    Name  Age  cities   age
0   John   28  mumbai   NaN
1  Alice   24  indore   NaN
2    Bob   23    pune  23.0

In [37]:
df1.loc[2,"Age"]=24
df1

    Name  Age  cities   age
0   John   28  mumbai   NaN
1  Alice   24  indore   NaN
2    Bob   24    pune  23.0

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [58]:
company_name=pd.Series(["apple","google","amazon","flipkart"])
company_salary=pd.Series([40,50,67,90])
company_city=pd.Series(["pune","banglore","mumbai","hyderabad"])


data_new={"name":company_name,
          "salary":company_salary,
          "location":company_city}
newest=pd.DataFrame(data_new)
newest

       name  salary   location
0     apple      40       pune
1    google      50   banglore
2    amazon      67     mumbai
3  flipkart      90  hyderabad